# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license

# Parameters
nc: 80 # number of classes
depth_multiple: 0.33 # model depth multiple
width_multiple: 0.50 # layer channel multiple
anchors:
  - [10, 13, 16, 30, 33, 23] # P3/8
  - [30, 61, 62, 45, 59, 119] # P4/16
  - [116, 90, 156, 198, 373, 326] # P5/32

# YOLOv5 v6.0 backbone
backbone:
  # [from, number, module, args]
  [
    [-1, 1, Conv, [64, 6, 2, 2]], # 0-P1/2
    [-1, 1, Conv, [128, 3, 2]], # 1-P2/4
    [-1, 3, C3, [128]],
    [-1, 1, Conv, [256, 3, 2]], # 3-P3/8
    [-1, 6, C3, [256]],
    [-1, 1, Conv, [512, 3, 2]], # 5-P4/16
    [-1, 9, C3, [512]],
    [-1, 1, Conv, [1024, 3, 2]], # 7-P5/32
    [-1, 3, C3, [1024]],
    [-1, 1, SPPF, [1024, 5]], # 9
  ]

# YOLOv5 v6.0 head #MC
head: [
    [-1, 1, Conv, [512, 1, 1]], # 10
    [-1, 1, nn.Upsample, [None, 2, "nearest"]], # 11
    [[-1, 6], 1, Concat, [1]], # 12
    [-1, 3, C3, [512, False]], # 13

    [-1, 1, Conv, [256, 1, 1]], # 14
    [-1, 1, nn.Upsample, [None, 2, "nearest"]], # 15
    [[-1, 4], 1, Concat, [1]], # 16
    [-1, 3, C3, [256, False]], # 17 P3

    [17, 1, MCEdgeDropBlock2d, [0.03, 5, 3.0, 1e-6, True]], # 18 P3 stochastic

    [17, 1, Conv, [256, 3, 2]], # 19
    [[-1, 14], 1, Concat, [1]], # 20
    [-1, 3, C3, [512, False]], # 21 P4

    [21, 1, MCEdgeDropBlock2d, [0.03, 5, 3.0, 1e-6, True]], # 22 P4 stochastic

    [21, 1, Conv, [512, 3, 2]], # 23
    [[-1, 10], 1, Concat, [1]], # 24
    [-1, 3, C3, [1024, False]], # 25 P5

    [25, 1, MCEdgeDropBlock2d, [0.03, 5, 3.0, 1e-6, True]], # 26 P5 stochastic

    [[18, 22, 26], 1, Detect, [nc, anchors]], # 27 Detect(P3, P4, P5)
  ]
